{
    "activities": [
        {
            "name": "Ucapan",
            "customer": {
                "name": "Michael Anggoro",
                "id": "1",
                "level": 2
            },
            "date": "14 Agustus 2023",
            "description": "Ulang Tahun",
            "id": "1",
            "message": "Dear Michael,\n\nWishing you a fantastic 38th birthday filled with joy, laughter, and unforgettable moments! As you celebrate another year of life, may it bring you new adventures, cherished memories, and continued success.\n\nYour journey so far has been remarkable, and we are proud to have you as a valuable member of our team. Your dedication, hard work, and positive energy inspire us all. May this new year ahead be filled with exciting opportunities and accomplishments that exceed even your wildest dreams.\n\nTake some time today to pamper yourself, indulge in your favorite treats, and bask in the love and warmth of your friends and family. You deserve all the happiness and success that life has to offer.\n\nHappy birthday once again, Michael! Here's to an amazing year ahead and many more to come.\n\nWarmest wishes",
            "benefits": "Berikut Beberapa Benefit yang mungkin cocok untuk Michael:\n\n1. Gift Card : Gift Card untuk Michael merayakan ulang tahunnya untuk dia membeli barang yang ingin ia beli\n\n2. Personalized Gifts : Dengan melihat sejarah Michael, karena Michael memiliki hobi bermain game, gift card untuk game yang ia sukai dapat menjadi haidah yang layak."
        },
        {
            "name": "Ucapan",
            "customer": {
                "name": "Amanda Putri",
                "id": "2",
                "level": 3
            },
            "date": "15 Agustus 2023",
            "description": "Selamat Kelahiran Anak",
            "id": "2",
            "message": "Dear Amanda,\n\nI hope this message finds you well. I wanted to extend my heartfelt congratulations to you and your son on this special occasion. Your unwavering support and dedication have undoubtedly played a significant role in his achievements.\n\nYour son is a testament to your love, guidance, and the values you've instilled in him. As he reaches this milestone, may his journey continue to be filled with success, happiness, and countless opportunities.\n\nPlease convey my warmest wishes to your son, and may his future be as bright as his potential.\n\nWarm regards",
            "benefits": "Berikut Beberapa Benefit yang mungkin cocok untuk Amanda:\n\n1. Gift Card : Gift Card untuk Amanda sehingga ia bisa membeli perlengkapan bayi\n\n2. Personalized Gifts : Hadiah Paket Bayi."
        },
        {
            "name": "Kirim",
            "customer": {
                "name": "Tsutsumi Chiyoko",
                "id": "3",
                "level": 2
            },
            "date": "15 Agustus 2023",
            "description": "Parsel atas Kesuksesan membuka toko baru",
            "id": "3",
            "message": "Dear Tsutsumi Chiyoko,\n\nCongratulations on your new store! Wishing you endless success and joy in this exciting venture. I've enclosed a little something to mark this milestone. May it bring luck and prosperity to your business. Cheers to your bright future!",
            "benefits": "Berikut Beberapa Ide Parsel yang mungkin cocok untuk Tsutsumi:\n\n1. Bunga : Bunga dengan ucapan yang dihias\n\n2. Bunga Selamat : Memberikan Karangan bunga congratulatory bagi tsutsumi."
        },
        {
            "name": "Ucapan",
            "customer": {
                "name": "Izaak Cahyono",
                "id": "4",
                "level": 1
            },
            "date": "15 Agustus 2023",
            "description": "Semoga Lekas Sembuh Sakit DBD",
            "id": "4",
            "message": "Dear Izaak Cahyono,\n\nI was saddened to hear about your battle with dengue fever, but I know your strength and resilience will help you overcome it. As you rest and recover, please remember that we're all here, sending healing thoughts and warm wishes your way. Your health is our top priority, and we can't wait to see you back on your feet, smiling and thriving. Take this time to rest, and soon you'll be back to enjoying life's beautiful moments. Get well soon, Izaak, and know that you're in our thoughts and prayers.",
            "benefits": "Berikut Beberapa Ide Benefit yang mungkin cocok untuk Izaak:\n\n1. Bunga : Bunga dengan ucapan semoga lekas sembuh yang dihias"
        },
        {
            "name": "Ucapan",
            "customer": {
                "name": "Toni Widjaja",
                "id": "5",
                "level": 1
            },
            "date": "15 Agustus 2023",
            "description": "Kelulusan Anak",
            "id": "5",
            "message": "Dear Toni Widjaja,\n\nCongratulations on this remarkable milestone! Your son's high school graduation is a testament to your guidance and his hard work. As he embarks on this exciting journey of adulthood, may his path be paved with success and fulfillment. Cherish these moments of achievement and look forward to a future filled with promise. Your dedication as a parent shines brightly today. Wishing your son all the best as he takes his next steps, and may his dreams continue to flourish.",
            "benefits": "Berikut Beberapa Ide Benefit yang mungkin cocok untuk Toni:\n\n1. Bunga : Bunga dengan ucapan selamat untuk kelulusan anaknya yang dihias \n\n2. Voucher Libur : Liburan Keluarga untuk Toni untuk merayakan kelulusan anaknya"
        },
        {
            "name": "Kirim",
            "customer": {
                "name": "Wilson Pranaya",
                "id": "6",
                "level": 1
            },
            "date": "15 Agustus 2023",
            "description": "Parsel Benefit Nasabah",
            "id": "6",
            "message": "Dear Wilson Pranaya,\n\nWe deeply appreciate your loyalty as a long-time customer. Enclosed is a token of our gratitude. Your continued support has been invaluable to us, and we look forward to serving you for many more years. Thank you for choosing us.",
            "benefits": "Berikut Beberapa Ide Benefit yang mungkin cocok untuk Toni:\n\n1. Bunga : Bunga dengan ucapan terima kasih karena sudah menjadi nasabah setia."
        },
        {
            "name": "Ucapan",
            "customer": {
                "name": "Faisal Rahman",
                "id": "7",
                "level": 2
            },
            "date": "16 Agustus 2023",
            "description": "Lekas Sembuh",
            "id": "7",
            "message": "Dear Faisal Rahman,\n\nI was truly saddened to hear about your illness, but I have no doubt that your strength and resilience will carry you through. Take this time to rest and heal, knowing that your friends and family are sending you all their love and support. We eagerly await your return to health and happiness. You're in our thoughts, and we believe in your swift recovery. Get well soon, Faisal, and may brighter days shine ahead.",
            "benefits": "Berikut Beberapa Ide Benefit yang mungkin cocok untuk Faisal:\n\n1. Bunga : Bunga dengan ucapan semoga lekas sembuh yang dihias."
        },
        {
            "name": "Ucapan",
            "customer": {
                "name": "Robert Wijayanto",
                "id": "8",
                "level": 3
            },
            "date": "17 Agustus 2023",
            "description": "Melahirkan Anak",
            "id": "8",
            "message": "Dear Robert Wijayanto,\n\nCongratulations on the arrival of your precious newborn son! This wonderful addition to your family brings immense joy and love. May each day with your little one be filled with laughter and cherished moments. Wishing you, your wife, and your baby boy a lifetime of happiness and endless blessings.",
            "benefits": "Berikut Beberapa Ide Benefit yang mungkin cocok untuk Robert:\n\n1. Bunga : Bunga dengan ucapan selamat atas bayinya. \n\n Personalized Gift : Coupon atau Voucher untuk Robert sehingga ia bisa membeli peralatan bayi dengan lebih murah"
        }
    ]
}